{
  "page": {
    "title": "API-Dokumentation",
    "description": "Integrieren Sie den KI-Assistenten in Ihre Anwendung. Greifen Sie über unsere REST-API auf Ausschreibungsanalyseergebnisse zu.",
    "auth": {
      "title": "Autorisierung",
      "description": "Alle API-Anfragen erfordern einen Schlüssel. Übergeben Sie ihn im Header",
      "header_example": "X-API-Key: ak_xxxxxxxxxxxxx"
    },
    "copied": "Kopiert!",
    "copied_description": "Code wurde in die Zwischenablage kopiert."
  },
  "endpoints": {
    "title": "Endpunkte",
    "results": {
      "title": "Ergebnisliste",
      "description": "Gibt eine Liste der Ausschreibungsanalyseergebnisse mit grundlegenden Informationen zurück (Name, Organisation, Einreichungsfrist).",
      "detailed_description": "Dieser Endpunkt ermöglicht es Ihnen, paginierte Ausschreibungsanalyseergebnisse abzurufen. Sie können Ergebnisse nach Datum filtern, die Anzahl der zurückgegebenen Elemente begrenzen und steuern, ob historische Ergebnisse einbezogen werden sollen.",
      "use_case": "Verwenden Sie dies zur Anzeige der Ergebnistabelle und zum Filtern nach Datum."
    },
    "criteria": {
      "title": "Bewertungskriterien",
      "description": "Detaillierte Analyse der Kriterienerfüllung für eine spezifische Ausschreibung mit Bewertung.",
      "detailed_description": "Ruft eine vollständige Analyse ab, wie eine bestimmte Ausschreibung nach definierten Kriterien bewertet wurde. Jedes Kriterium enthält eine Punktzahl, das KI-Vertrauensniveau, eine Begründung und Informationen darüber, ob es disqualifizierend ist. Diese Daten ermöglichen es zu verstehen, warum eine Ausschreibung eine bestimmte Bewertung erhalten hat.",
      "use_case": "Verwenden Sie dies zur Anzeige einer detaillierten Analyse, warum eine bestimmte Ausschreibung eine spezifische Bewertung erhalten hat."
    },
    "files": {
      "title": "Ausschreibungsdateien",
      "description": "Liste der mit der Ausschreibung verbundenen Dokumente (Spezifikationen, Anforderungen, Anhänge) mit Vorschauoption.",
      "detailed_description": "Gibt eine vollständige Liste aller für eine bestimmte Ausschreibung heruntergeladenen Dokumente zurück. Jede Datei enthält einen Download-Link, die Größe und eine optionale Vorschau der ersten Inhaltsfragmente. Dokumente werden automatisch heruntergeladen und während des Ausschreibungsbewertungsprozesses analysiert.",
      "use_case": "Verwenden Sie dies zur Anzeige der Liste herunterladbarer Dokumente und ihrer Vorschau."
    }
  },
  "tabs": {
    "overview": "Übersicht",
    "request": "Anfrage",
    "response": "Antwort",
    "examples": "Beispiele"
  },
  "overview": {
    "description": "Beschreibung",
    "endpoint": "Endpunkt",
    "when_to_use": "Wann zu verwenden",
    "quick_start": "Schnellstart",
    "step1": "Fügen Sie den Autorisierungs-Header mit API-Schlüssel hinzu",
    "step2_post": "Senden Sie Daten im Request-Body",
    "step2_get": "Ersetzen Sie result_id durch eine echte Ergebnis-ID",
    "step3": "Sie erhalten Daten im JSON-Format"
  },
  "request": {
    "body": "Request Body",
    "query_params": "Query Parameter",
    "headers": "Headers"
  },
  "response": {
    "structure": "Antwortstruktur",
    "example": "Antwortbeispiel",
    "status_codes": "Statuscodes",
    "success": "Erfolgreich",
    "unauthorized": "Nicht autorisiert – ungültiger API-Schlüssel",
    "not_found": "Ressource nicht gefunden",
    "server_error": "Serverfehler"
  },
  "examples": {
    "javascript": "JavaScript",
    "copy": "Kopieren"
  }
}